miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
    /* Set destination pointer */
    dst = (uint32_t *)FCU_RAM_TOP;

    /* Iterate for loop to copy the FCU firmware */
    for( i=0; i<(FCU_RAM_SIZE/4); i++)
    {
        /* Copy data from the source to the destination pointer */
        *dst = *src;

        /* Increment the source and destination pointers */
        src++;
        dst++;
    }
#endif

    /* FCU firmware transfer complete, set the flag to 1 */
    g_fcu_transfer_complete = 1;

    /* Return no errors */
    return FLASH_SUCCESS;
}
/******************************************************************************
End of function  flash_init
******************************************************************************/
/*********************************************************************************************************************
 External variables and functions
 *********************************************************************************************************************/
extern flash_states_t g_flash_state;

/***********************************************************************************************************************
* Function Name: flash_api_open
* Description  : Function will initialize the flash for the RX600/RX200 family.
* Arguments    : void
* Return Value : FLASH_SUCCESS -
*                    API initialized successfully.
*                FLASH_ERR_BUSY
*                    API has already been initialized and another operation is ongoing.
*                FLASH_ERR_ALREADY_OPEN
*                    Open() called twice without intermediate Close()
*                FLASH_ERR_FAILURE
*                    Initialization failed.
*                    A RESET was performed on the Flash circuit to rectify any internal errors
***********************************************************************************************************************/
flash_err_t flash_api_open(void)
{

    /* Lock driver to initialize */
    if (flash_grab_state(FLASH_INITIALIZATION) != FLASH_SUCCESS )
    {
        return FLASH_ERR_BUSY;
    }

    if (g_driver_opened == true)
    {
        flash_release_state2();
        return FLASH_ERR_ALREADY_OPEN;
    }

    /* If FCU firmware has already been transferred to FCU RAM,
       no need to do it again */
    if( !g_fcu_transfer_complete )
    {
        /* Initialise the FCU, and store operation resilt in result variable */
        /* Check if FCU initialisation was successful */
        if( flash_init() != FLASH_SUCCESS )
        {
            /* Unlock driver */
            flash_release_state2();

            /* FCU initialisiation failed - return operation failure */
            return FLASH_ERR_FAILURE;
        }
    }

    /* Unlock driver */
    g_driver_opened = true;
    flash_release_state2();


    return FLASH_SUCCESS;
}


/***********************************************************************************************************************
* Function Name: flash_api_close
* Description  : This function sets the driver back to pre-Open() conditions.
* Arguments    : void
* Return Value : FLASH_SUCCESS -
*                    API closed successfully.
*                FLASH_ERR_BUSY
*                    Another operation is ongoing.
***********************************************************************************************************************/
flash_err_t flash_api_close(void)
{

    /* Lock driver */
    if (flash_grab_state(FLASH_UNINITIALIZED) != FLASH_SUCCESS )
    {
        return FLASH_ERR_BUSY;
    }


    /* mark fcu as uninitialized */
    g_fcu_transfer_complete = 0;


    /* disable interrupts if enabled */
#if ((FLASH_CFG_DATA_FLASH_BGO == 1) || (FLASH_CFG_CODE_FLASH_BGO == 1))
    /* Disable flash interface error (FIFERR) */
    IEN(FCU, FIFERR) = 0;
    /* Disable flash ready interrupt (FRDYI) */
    IEN(FCU, FRDYI) = 0;
#endif

    /* Show driver as closed and release hold on lock.
     * Do not use flash_release_state2() because we do not want to set state to FLASH_READY.
     */
    g_driver_opened = false;
    flash_softwareUnlock(&g_flash_lock2);

    return FLASH_SUCCESS;
}


/******************************************************************************
* Function Name: data_flash_status_clear
* Description  : Clear the status of the Data Flash operation.
*                NOTE: This function does not have to execute from in RAM.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void data_flash_status_clear (void)
{
    /* Declare temporary pointer */
    FCU_BYTE_PTR ptrb;

    /* Set pointer to Data Flash to issue a FCU command if needed */
    ptrb = (FCU_BYTE_PTR)(DF_ADDRESS);

    /* Check to see if an error has occurred with the FCU.  If set, then
       issue a status clear command to bring the FCU out of the
       command-locked state */
    if(FLASH.FSTATR0.BIT.ILGLERR == 1)
    {
        /* FASTAT must be set to 0x10 before the status clear command
           can be successfully issued  */
        if(FLASH.FASTAT.BYTE != 0x10)
        {
            /* Set the FASTAT register to 0x10 so that a status clear
               command can be issued */
            FLASH.FASTAT.BYTE = 0x10;
        }
    }

    /* Issue a status clear command to the FCU */
    *ptrb = 0x50;
}
/******************************************************************************
End of function  data_flash_status_clear
******************************************************************************/

/******************************************************************************
* Function Name: data_flash_write
* Description  : Write either bytes to Data Flash area.
*                NOTE: This function does not have to execute from in RAM.
* Arguments    : address -
*                    The address (in the Data Flash programming area)
*                    to write the data to
*                data -
*                    The address of the data to write
*                size -
*                    The size of the data to write. Must be set to
*                    either DF_PROGRAM_SIZE_LARGE or DF_PROGRAM_SIZE_SMALL.
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_ERR_FAILURE -
*                    Operation Failed
******************************************************************************/
static flash_err_t data_flash_write (uint32_t address, uint32_t data, uint32_t size)
{
    /* Declare wait counter variable */
    volatile int32_t wait_cnt;

    /* Define loop iteration count variable */
    volatile uint32_t n = 0;

    /* Check data size is valid */
#if defined(DF_PROGRAM_SIZE_LARGE)
    if((DF_PROGRAM_SIZE_LARGE == size) || (DF_PROGRAM_SIZE_SMALL == size))
#else
    if(DF_PROGRAM_SIZE_SMALL == size)
#endif
    {

        /* Perform bit shift since 2 bytes are written at a time */
        size = (uint8_t)(size >> 1);


        /* Send command to data flash area */
        *(FCU_BYTE_PTR)DF_ADDRESS = 0xE8;

        /* Specify data transfer size to data flash area */
        *(FCU_BYTE_PTR)DF_ADDRESS = size;

