miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
        /* Iterate through the number of data bytes */
        while(n++ < size)
        {
            /* Copy data from source address to destination area */
            *(FCU_WORD_PTR)address = *(uint16_t *)data;

            /* Increment data address by two bytes */
            data += 2;
        }

        /* Write the final FCU command for programming */
        *(FCU_BYTE_PTR)(DF_ADDRESS) = 0xD0;

#if (FLASH_CFG_DATA_FLASH_BGO == 1)
        /* Program is ongoing, return */
        return FLASH_SUCCESS;
#endif

        /* Set the wait counter with timeout value */
        wait_cnt = WAIT_MAX_DF_WRITE;

        /* Check if FCU has completed its last operation */
        while(FLASH.FSTATR0.BIT.FRDY == 0)
        {
            /* Decrement the wait counter */
            wait_cnt--;

            /* Check if the wait counter has reached zero */
            if(wait_cnt == 0)
            {
                /* Maximum time for writing a block has passed,
                   operation failed, reset FCU */
                flash_reset();

                /* Return FLASH_FAILURE, operation failure */
                return FLASH_ERR_FAILURE;
            }
        }

        /* Check for illegal command or programming errors */
        if((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.PRGERR == 1))
        {
            /* Return FLASH_FAILURE, operation failure */
            return FLASH_ERR_FAILURE;
        }
    }
    /* Data size is invalid */
    else
    {
        /*Return FLASH_FAILURE, operation failure */
        return FLASH_ERR_FAILURE;
    }

    /* Return FLASH_SUCCESS, operation success */
    return FLASH_SUCCESS;
}
/******************************************************************************
End of function  data_flash_write
******************************************************************************/


#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#pragma section FRAM
#endif

/***********************************************************************************************************************
* Function Name: flash_api_blankcheck
* Description  : Performs a blank check on a specified data flash block
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
*                NOTE2: RX610 & RX62x support block and 8 byte checks
*                       RX630/631/63N support block and 2 byte checks
* Arguments    : address -
*                    The address to check if is blank.
*                    If the parameter 'size'=='BLANK_CHECK_8_BYTE',
*                    this should be set to an 8-byte address boundary.
*                    If the parameter 'size'=='BLANK_CHECK_ENTIRE_BLOCK',
*                    this should be set to an address in the data flash block.
*                    If the parameter 'size'=='BLANK_CHECK_2_BYTE',
*                    this should be set to a 2 byte address boundary.
*                size -
*                    This specifies if you are checking an 8-byte location,
*                    2-byte location, or an entire block. You must set this
*                    to either 'BLANK_CHECK_8_BYTE', 'BLANK_CHECK_2_BYTE',
*                    or 'BLANK_CHECK_ENTIRE_BLOCK'.
*
*                result -
*                 Returns the result of the blank check operation. This field is valid only in non-BGO mode
*                 operation
*
*  Return Value : FLASH_SUCCESS
*                 Operation was completed successfully. In non-BGO (blocking) mode result contains blank check status
*                FLASH_ERR_BYTES -
*                    Incorrect 'size' was submitted
*                FLASH_ERR_ADRRESS -
*                    Start address is an invalid Data Flash Address
*                FLASH_ERR_BUSY
*                    Flash peripheral is busy with another operation or not initialized
*                FLASH_ERR_FAILURE -
*                    Operation failed for some other reason.*
***********************************************************************************************************************/
flash_err_t flash_api_blankcheck(uint32_t address, uint32_t size, flash_res_t *result)
{

    /* Declare data flash pointer */
    FCU_BYTE_PTR ptrb;

    /* Declare result container variable */
    uint8_t local_result;

    /* Declare wait counter variable */
    volatile int32_t wait_cnt;

    /* Check to make sure address is valid. */
    if((address < FLASH_DF_BLOCK_0) || (address >= FLASH_DF_BLOCK_INVALID) )
    {
        /* Address is not a valid DF address */
        return FLASH_ERR_ADDRESS;
    }

    if (size == BLANK_CHECK_SMALLEST)
    {
        /* Make sure address is aligned correctly. */
        if( address & (DF_PROGRAM_SIZE_SMALL-1) )
        {
            /* Return address not on a programming boundary */
            return FLASH_ERR_ALIGNED;
        }
    }

    /* Check to make sure 'size' parameter is valid */
     if( (size != BLANK_CHECK_ENTIRE_BLOCK) && (size != BLANK_CHECK_SMALLEST) )
     {
         /* 'size' parameter is not valid. */
         return FLASH_ERR_BYTES;
     }

    /* Attempt to grab state */
    if( flash_grab_state(FLASH_BLANKCHECK) != FLASH_SUCCESS )
    {
        /* Another operation is already in progress */
        return FLASH_ERR_BUSY;
    }

    /* Set current FCU mode to Data Flash PE Mode */
    g_current_mode = FLD_PE_MODE;

    /* Enter Data Flash PE mode in the FCU */
    if( enter_pe_mode(address) != FLASH_SUCCESS)
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode(address);

        /* Release state */
        flash_release_state2();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_ERR_FAILURE;
    }

    /* Set  bit FRDMD (bit 4) in FMODR to 1 */
    FLASH.FMODR.BIT.FRDMD = 1;

    /* Check if smallest check size has been passed */
    if(size == BLANK_CHECK_SMALLEST)
    {
        /* Set data flash pointer to beginning of the memory block */
        ptrb = (FCU_BYTE_PTR)(address & DF_MASK);

        /* Check if the next N bytes are blank (N = DF_PROGRAM_SIZE_SMALL)
           Bits BCADR to the address of the N-byte location to check.
           Set bit BCSIZE in EEPBCCNT to 0. */
        FLASH.DFLBCCNT.WORD = (uint16_t)(address & ~(DF_MASK));
    }
    /* Check entire data block */
    else
    {

        /* Any address in the erasure block */
        ptrb = (FCU_BYTE_PTR)address;

