miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
        /* Check if the entire block is blank
           Set bit BCSIZE in EEPBCCNT to 1. */
        FLASH.DFLBCCNT.BIT.BCSIZE = 1;
    }


    /* Send commands to FCU */
    *ptrb = 0x71;
    *ptrb = 0xD0;

#if (FLASH_CFG_DATA_FLASH_BGO == 1)
    /* Only using BGO on block blank checks */
    if( size == BLANK_CHECK_ENTIRE_BLOCK )
    {
        /* Set global address in case we have error and need to reset FCU. */
        g_bgo_flash_addr = address;

        /* Return, check result later in ISR */
        return FLASH_SUCCESS;
    }
#endif

    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_BLANK_CHECK;

    /* Wait until FCU operation finishes, or a timeout occurs */
    while(FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if(wait_cnt == 0)
        {
            /* Maximum timeout duration for writing to ROM has elapsed -
               assume operation failure and reset the FCU */
            flash_reset();

            /* Return FLASH_ERR_TIMEOUT, operation failure */
            return FLASH_ERR_TIMEOUT;
        }
    }

    /* Reset the FRDMD bit back to 0 */
    FLASH.FMODR.BIT.FRDMD = 0x00;

    /* Check if the 'ILGERR' was set during the command */
    if(FLASH.FSTATR0.BIT.ILGLERR == 1)  /* Check 'ILGERR' bit */
    {
        /* Take the FCU out of PE mode */
        exit_pe_mode(address);

        /* Release state */
        flash_release_state2();

        /* Return FLASH_ERR_FAILURE, operation failure */
        return FLASH_ERR_FAILURE;
    }

    /* (Read the 'BCST' bit (bit 0) in the 'DFLBCSTAT' register
       0=blank, 1=not blank */
    local_result = (uint8_t)FLASH.DFLBCSTAT.BIT.BCST;

    /* Take the FCU out of PE mode */
    exit_pe_mode(address);

    /* Release state */
    flash_release_state2();

    /* Return (Not Blank/Blank), operation successful */
    if( local_result == 0 )
    {
        /* Block was blank */
        *result = FLASH_RES_BLANK;
    }
    else
    {
        /* Block was not blank */
        *result = FLASH_RES_NOT_BLANK;
    }
    return FLASH_SUCCESS;
}

/******************************************************************************
* Function Name: flash_access_window_set
* Description  : This function is used to allow read and program permissions
*                to the Data Flash areas.
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
* Arguments    :     pAccessInfo->read_en_mask -
*                    Bitmasked value. Bits 0-3 represents each Data
*                    Blocks 0-3 (respectively).
*                    '0'=no Read access.
*                    '1'=Allows Read by CPU
*
*                    pAccessInfo->write_en_mask -
*                    Bitmasked value. Bits 0-3 represents each Data
*                    Blocks 0-3 (respectively).
*                    '0'=no Erase/Write access.
*                    '1'=Allows Erase/Write by FCU
* Return Value : none
******************************************************************************/
void flash_access_window_set(flash_access_window_config_t *pAccessInfo)
{
    /* Used for making sure select bits are not set. */
    uint16_t temp_mask = 0x00FF;

#if   defined(MCU_RX610)

    /* Set Read access for the Data Flash blocks */
    FLASH.DFLRE.WORD = (uint16_t)(0x2D00 | (pAccessInfo->read_en_mask & 0x00FF));

    /* Set Erase/Program access for the Data Flash blocks */
    FLASH.DFLWE.WORD = (uint16_t)(0x1E00 | (pAccessInfo->write_en_mask & 0x00FF));

#else

    #if MCU_DATA_FLASH_SIZE_BYTES == 8192
    /* Mask off bits 4-7 to make sure they are 0. */
    temp_mask = 0x000F;
    #endif

    /* Set Read access for the Data Flash blocks DB0-DB7 */
    FLASH.DFLRE0.WORD = (uint16_t)(0x2D00 | (pAccessInfo->read_en_mask & temp_mask));

    /* Set Erase/Program access for the Data Flash blocks DB0-DB7 */
    FLASH.DFLWE0.WORD = (uint16_t)(0x1E00 |  (pAccessInfo->write_en_mask & temp_mask));

#if MCU_DATA_FLASH_SIZE_BYTES > 16384
    /* Set Read access for the Data Flash blocks DB8-DB15 */
    FLASH.DFLRE1.WORD = (uint16_t)(0xD200 | ((pAccessInfo->read_en_mask >> 8) & 0x00FF));

    /* Set Erase/Program access for the Data Flash blocks DB8-DB15 */
    FLASH.DFLWE1.WORD = (uint16_t)(0xE100 |  ((pAccessInfo->write_en_mask >> 8) & 0x00FF));
#endif

#endif
}



/******************************************************************************
* Function Name: flash_getStatus
* Description  : Returns the current state of the flash
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
* Arguments    : none
* Return Value : FLASH_SUCCESS -flash_getStatus
*                    Flash is ready to use
*                FLASH_ERR_BUSY -
*                    Flash is busy with another operation
******************************************************************************/
flash_err_t flash_getStatus (void)
{
    /* Return flash status */
    if( g_flash_state == FLASH_READY )
    {
        return FLASH_SUCCESS;
    }
    else
    {
        return FLASH_ERR_BUSY;
    }
}
/******************************************************************************
End of function  R_FlashGetStatus
******************************************************************************/


/******************************************************************************
* Function Name: flash_grab_state
* Description  : Attempt to grab the flash state to perform an operation
*                NOTE1: This function does not have to execute from in RAM. It
*                       must be in RAM though if FLASH_CFG_CODE_FLASH_BGO is
*                       enabled and this function is called during a ROM P/E
*                       operation.
* Arguments    : new_state -
*                    Which state to attempt to transition to
* Return Value : FLASH_SUCCESS -
*                    State was grabbed
*                FLASH_BUSY -
*                    Flash is busy with another operation
******************************************************************************/
static uint8_t flash_grab_state (flash_states_t new_state)
{
    /* Check to see if lock was successfully taken */
    if (flash_softwareLock(&g_flash_lock2) == true)
    {
        /* Lock taken, we can change state */
        g_flash_state = new_state;

        /* Return success */
        return FLASH_SUCCESS;
    }
    else
    {
        /* Another operation is on-going */
        return FLASH_ERR_BUSY;
    }
}
/******************************************************************************
End of function  flash_grab_state
******************************************************************************/


