miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
                /* Advance pointer to next block */
                g_bgo_flash_addr += DF_ERASE_BLOCK_SIZE;

                /* Subtract off bytes erased */
                g_bgo_bytes -= DF_ERASE_BLOCK_SIZE;

                return;
            }
        }
        else // code flash
        {
            /* Check to see if there are more bytes to erase. */
            if( 0 < g_bgo_bytes )
            {
                /* Send FCU command to erase block. Cannot fail in BGO mode */
                flash_erase_command((FCU_BYTE_PTR)g_bgo_flash_addr);

                /* Advance pointer to next block */
                bytes_erased = flash_get_romBlock_size(g_bgo_flash_addr, &block_info);
                g_bgo_bytes -= bytes_erased;

                if (g_bgo_bytes > 0)
                {
                    block_number = block_info.block_number - 1;         // next block to erase
                    flash_get_romBlock_info (block_number, &block_info);

                    g_bgo_flash_addr = block_info.start_addr;
                }

                return;
            }
        }


        /* Leave Program/Erase Mode */
        exit_pe_mode(g_bgo_flash_addr);

        /* Release flash state */
        flash_release_state2();

        /* Flash operation finished callback function */
        FlashEraseDone();
    }
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
    else if( g_flash_state == FLASH_BLANKCHECK )
    {
        /* Blank check finished, check result */

        /* Reset the FRDMD bit back to 0 */
        FLASH.FMODR.BIT.FRDMD = 0x00;

        /* (Read the 'BCST' bit (bit 0) in the 'DFLBCSTAT' register
           0=blank, 1=not blank */
        ret = (uint8_t)FLASH.DFLBCSTAT.BIT.BCST;

        /* Take the FCU out of PE mode */
        exit_pe_mode(g_bgo_flash_addr);

        /* Release flash state */
        flash_release_state2();

        /* Return result, 0 means blank, 1 means not blank */
        if(ret == 0)
        {
            FlashBlankCheckDone(FLASH_RES_BLANK);
        }
        else
        {
            FlashBlankCheckDone(FLASH_RES_NOT_BLANK);
        }
    }
#endif
    else if( g_flash_state == FLASH_WRITING )
    {
        /* Iterate while there are still bytes remaining to write */
        if( g_bgo_bytes > 0 )
        {
            /* Get maximum programming size that can currently be used. */
            num_byte_to_write = flash_get_program_size(g_bgo_bytes, g_bgo_flash_addr);

#ifdef FLASH_CFG_FLASH_TO_FLASH
            /* Check to see if we need to buffer more data */
            if( g_flash_to_flash_op == 1 )
            {
                /* We must leave PE mode to transfer next buffer to RAM */
                exit_pe_mode(g_bgo_flash_addr);

                /* Copy over next bytes to write */
                for(i = 0; i < num_byte_to_write; i++)
                {
                    /* Copy over each byte */
                    g_temp_array[i] = *((uint8_t *)(g_bgo_buffer_addr+i));
                }

                /* Re-enter PE mode, check if operation is successful */
                if( enter_pe_mode(g_bgo_flash_addr) != FLASH_SUCCESS)
                {
                    /* Leave Program/Erase Mode and clear any error flags */
                    exit_pe_mode(g_bgo_flash_addr);

                    /* Release flash state */
                    flash_release_state2();

                    /* Operation failure, use callback function to alert user */
                    FlashError();

                    /* Exit ISR */
                    return;
                }
            }
#endif

            /* Are we writing DF or ROM? */
            if( g_current_mode == FLD_PE_MODE )
            {
                /* Writing DF */
                /* Call the Programming function again for next bytes */
#ifdef FLASH_CFG_FLASH_TO_FLASH
                if( g_flash_to_flash_op == 1 )
                {
                    ret = data_flash_write( g_bgo_flash_addr,
                                            (uint32_t)&g_temp_array[0],
                                            num_byte_to_write);
                }
                else
                {
                    ret = data_flash_write( g_bgo_flash_addr,
                                            g_bgo_buffer_addr,
                                            num_byte_to_write);
                }
#else
                ret = data_flash_write( g_bgo_flash_addr,
                                        g_bgo_buffer_addr,
                                        num_byte_to_write);
#endif
            }
            else
            {
                /* Writing ROM */
                /* Call the Programming function */
#ifdef FLASH_CFG_FLASH_TO_FLASH
                if( g_flash_to_flash_op == 1 )
                {
                    /* Use RAM array */
                    ret = rom_write(g_bgo_flash_addr,
                                    (uint32_t)&g_temp_array[0],
                                    num_byte_to_write);
                }
                else
                {
                    /* Go as usual */
                    ret = rom_write(g_bgo_flash_addr,
                                    g_bgo_buffer_addr,
                                    num_byte_to_write);
                }
#else
                ret = rom_write(g_bgo_flash_addr,
                                g_bgo_buffer_addr,
                                num_byte_to_write);
#endif
            }

            /* Check the result for errors */
            if( ret != FLASH_SUCCESS )
            {
                /* Error detected during programming, stop and return */
                /* Leave Program/Erase Mode and clear any error flags */
                exit_pe_mode(g_bgo_flash_addr);

                /* Release flash state */
                flash_release_state2();

                /* Operation failure, use callback function to alert user */
                FlashError();

                /* Exit ISR */
                return;
            }

            /* Increment the flash address and the buffer address by the size
               of the transfer thats just completed */
            g_bgo_flash_addr += num_byte_to_write;
            g_bgo_buffer_addr += num_byte_to_write;

            /* Decrement the number of bytes remaining by the size of the last
               flash write */
            g_bgo_bytes -= num_byte_to_write;

