miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
        }
        else
        {
            /* Leave Program/Erase Mode */
            exit_pe_mode(g_bgo_flash_addr);

            /* Release flash state */
            flash_release_state2();

            /* Flash operation finished callback function */
            FlashWriteDone();
        }

    }
    else
    {
        /* NOTE: Should never get here. However, sometimes after a FIFERR occurs
         * and errors are reset, an FRDYI interrupt occurs. The g_flash_state is
         * FLASH_READY which causes this else condition to occur. One logic analyzer
         * traced occurrence of this is doing a large write to data flash when
         * the area is not erased first.
         */
        nop();
    }
}
/******************************************************************************
End of function  flash_ready_isr
******************************************************************************/

#endif





#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#pragma section FRAM
#endif

/******************************************************************************
* Function Name: rom_write
* Description  : Write bytes to ROM Area Flash.
*                NOTE: This function MUST execute from in RAM.
* Arguments    : address -
*                    ROM address of where to write to
*                data -
*                    Pointer to the data to write
*                size -
*                    The size of the data to write. Must be set to
*                    either a supported write size of the MCU.
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_ERR_FAILURE -
*                    Operation Failed
******************************************************************************/
static flash_err_t rom_write (uint32_t address, uint32_t data, uint32_t size)
{
/* If ROM programming is not enabled then do not compile this code as it is
   not needed. */
#ifdef FLASH_CFG_CODE_FLASH_ENABLE

    /* Declare iteration loop count variable */
    volatile uint32_t i;
    /* Declare wait counter variable */
    volatile int32_t  wait_cnt;

    /* Writes are done 16-bits (2 bytes) at a time, scale 'size' argument */
    size = size >> 1;

    /* Write the FCU Program command */
    *(FCU_BYTE_PTR)address = 0xE8;
    *(FCU_BYTE_PTR)address = size;

    /* Write 'size' bytes into flash, 16-bits at a time */
    for(i = 0; i < size; i++)
    {
        /* Copy data from source address to destination ROM */
        *(FCU_WORD_PTR)address = *(uint16_t *)data;

        /* Increment destination address by 2 bytes */
        data += 2;
    }

    /* Write the final FCU command for programming */
    *(FCU_BYTE_PTR)address = 0xD0;

    #if (FLASH_CFG_CODE_FLASH_BGO == 1)
    /* Return, rest of programming will be done in interrupt */
    return FLASH_SUCCESS;
    #endif

    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_ROM_WRITE;

    /* Wait until FCU operation finishes, or a timeout occurs */
    while(FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if(wait_cnt == 0)
        {
            /* Maximum timeout duration for writing to ROM has elapsed -
               assume operation failure and reset the FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure */
            return FLASH_ERR_FAILURE;
        }
    }

    /* Check for illegal command or programming errors */
    if((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.PRGERR  == 1))
    {
        /* Return FLASH_FAILURE, operation failure */
        return FLASH_ERR_FAILURE;
    }

#endif /* FLASH_CFG_ENABLE_ROM_PROGRAMMING */

    /* If ROM programming is not enabled then this function will always just
       return FLASH_SUCCESS. This is okay because this function will never
       actually be called. The API write function will return an error when
       a ROM address is entered for programming. */

    /* Return FLASH_SUCCESS, operation successful */
    return FLASH_SUCCESS;
}
/******************************************************************************
End of function  rom_write
******************************************************************************/

/******************************************************************************
* Function Name: enter_pe_mode
* Description  : Puts the FCU into program/erase mode.
*                NOTE: This function MUST execute from in RAM for 'ROM Area'
*                programming, but if you are ONLY doing Data Flash programming,
*                this function can reside and execute in Flash.
* Arguments    : flash_addr -
*                    The programming/erasure address
*                bytes -
*                    The number of bytes you are writing (if you are writing).
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_FAILURE -
*                    Operation Failed
******************************************************************************/
static uint8_t enter_pe_mode (uint32_t flash_addr)
{
    /* Used for timeout on FENTRYR write/read. */
    volatile int32_t wait_cnt;


    /* FENTRYR must be 0x0000 before bit FENTRY0 or FENTRYD can be set to 1 */
    FLASH.FENTRYR.WORD = 0xAA00;

    /* Initialize timeout for FENTRYR being written. */
    wait_cnt = FLASH_FENTRYR_TIMEOUT;

    /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
    while(0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Wait until FENTRYR is 0 unless timeout occurs. */
        if (wait_cnt-- <= 0)
        {
            /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. */
            return FLASH_ERR_FAILURE;
        }
    }

    /* Check if FCU mode is set to ROM PE */
    if( g_current_mode == ROM_PE_MODE)
    {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
        /* Don't enable flash interrupts if programming lock bits */
        if( g_flash_state != FLASH_LOCK_BIT )
        {
            /* Re-enable the FRDYI interrupt */
            FLASH.FRDYIE.BIT.FRDYIE = 1;
        }
#else
        /* Disable the FRDYI interrupt */
        FLASH.FRDYIE.BIT.FRDYIE = 0;
#endif

