miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
    /* Initialize timeout for FENTRYR being written. */
    wait_cnt = FLASH_FENTRYR_TIMEOUT;

    /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
    while(0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Wait until FENTRYR is 0 unless timeout occurs. */
        if (wait_cnt-- <= 0)
        {
            /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. Could add a call to FlashError()
               here if user wants to process this. */
            break;
        }
    }

    /* Disable the FRDYI interrupt */
    FLASH.FRDYIE.BIT.FRDYIE = 0;

    /* Flash write/erase disabled */
    FLASH.FWEPROR.BYTE = 0x02;

}







/******************************************************************************
* Function Name: flash_get_romBlock_size
* Description  : Return the size of the ROM block for this address, as well as
*                the starting and ending addresses for this block.
* Arguments    : romaddr -The address for which the rom block info is being requested
*                rom_block_info_t* block_info - ptr to a rom_block_info_t structure
*                                  which will hold the block info
* Return Value : 0   Invalid address supplied
*                    Block size otherwise
******************************************************************************/
uint32_t flash_get_romBlock_size (uint32_t romaddr, rom_block_info_t* pblock_info)
{
    uint16_t  index = 0;
    volatile rom_block_sizes_t block_info;
    volatile uint32_t total_section_size;
    volatile uint32_t this_section_blockSt = 0;

    if (pblock_info == NULL)
        return(0);

    block_info =  g_flash_RomBlockSizes[0];
    total_section_size  = block_info.block_size * block_info.num_blocks;

    pblock_info->end_addr = FLASH_CF_BLOCK_0 + block_info.block_size-1;
    pblock_info->start_addr = (pblock_info->end_addr - (total_section_size))+1;
    pblock_info->block_number = 0;

    for (index = 1; index < NUM_BLOCK_TABLE_ENTRIES; index++)
    {
        // Is this address in this block range?
        if ((romaddr >= pblock_info->start_addr)  && (romaddr <= pblock_info->end_addr))
            break;
        pblock_info->block_number += block_info.num_blocks;
        this_section_blockSt = block_info.num_blocks-1;
        block_info =  g_flash_RomBlockSizes[index];
        total_section_size  = block_info.block_size * block_info.num_blocks;
        pblock_info->end_addr = pblock_info->start_addr - 1;
        pblock_info->start_addr -= total_section_size;
    }

    pblock_info->block_number += ((pblock_info->end_addr - romaddr)/block_info.block_size);
    pblock_info->thisblock_stAddr = (pblock_info->end_addr - (pblock_info->block_number - this_section_blockSt)*block_info.block_size)+1;
    pblock_info->block_size = block_info.block_size;
    return(block_info.block_size);
}
/******************************************************************************
End of function  flash_get_romBlock_size
******************************************************************************/


/******************************************************************************
* Function Name: flash_get_romBlock_info
* Description  : Return the details for the supplied Rom block number
*                the starting and ending addresses for this block.
* Arguments    : block_number - A valid ROM block number
*                rom_block_info_t* block_info - ptr to a rom_block_info_t structure
*                                  which will hold the block info.
* Return Value : False   Invalid block supplied
*                True -  supplied block_info structure holds the block info
******************************************************************************/
bool flash_get_romBlock_info (uint32_t block_number, rom_block_info_t* pblock_info)
{
    uint16_t  this_block = 0;
    rom_block_sizes_t bl_info =  g_flash_RomBlockSizes[0];
    volatile uint32_t total_section_size  = bl_info.block_size * bl_info.num_blocks;
    volatile uint32_t this_section_blockSt = 0;
    volatile uint32_t section_counter = 0;
    volatile uint32_t blksize_counter = 0;


    if (block_number > ROM_NUM_BLOCKS)
        return(false);

    pblock_info->end_addr = FLASH_CF_BLOCK_0 + bl_info.block_size-1;
    pblock_info->start_addr = FLASH_CF_BLOCK_0;
    pblock_info->block_size = bl_info.block_size;

    for (this_block = 0; this_block < ROM_NUM_BLOCKS; this_block++)
    {
        if (this_block == block_number)
            break;

        if (blksize_counter++ == bl_info.num_blocks-1)
        {
            bl_info =  g_flash_RomBlockSizes[++section_counter];
            blksize_counter = 0;
        }
        pblock_info->end_addr = pblock_info->start_addr-1;
        pblock_info->start_addr -= bl_info.block_size;
        pblock_info->block_size = bl_info.block_size;

    }

    return(true);
}
/******************************************************************************
End of function  flash_get_romBlock_info
******************************************************************************/


/***********************************************************************************************************************
* Function Name: flash_api_erase
* Description  : This function executes specific functionality to erase the specified Code or Data Flash blocks.
* Arguments    : uint32_t block_start_address -
*                 Start address of the first block. Actual address or entry from "flash_block_address_t" enum can be used
*                uint32_t num_blocks -
*                 For FCU based MCU's the number of blocks is always 1.
*                 Only a single block may be erased at a time.
* Return Value : FLASH_SUCCESS -
*                    Erase completed successfully; successfully initialized in case of BGO mode.
*                FLASH_ERR_ADRRESS -
*                    Start address is an invalid Code/Data Flash block start address
*                FLASH_ERR_BOUNDARY - The block_start_address and accompanying num_blocks cross one of the
*                                     defined ROM AREA boundaries.
*                FLASH_ERR_BUSY -
*                    Flash peripheral is busy with another operation
*                FLASH_ERR_FAILURE
*                    Flash Write operation failed for some other reason. This can be a result of trying to erase an area
*                    that has been protected via access control.
***********************************************************************************************************************/
flash_err_t flash_api_erase(flash_block_address_t block_start_address, uint32_t num_blocks)
{
    flash_err_t  result = FLASH_SUCCESS;
    uint32_t p_addr = (uint32_t )block_start_address;        /* Declare address pointer */
    rom_block_info_t block_info;
    uint32_t blockcnt = 0;
    uint32_t block_number;
    uint32_t initial_block_number;
    uint32_t entry_address;
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
    uint32_t block_size;
#endif

    volatile int32_t bytes_to_erase = (int32_t)(FLASH_DF_BLOCK_1 - FLASH_DF_BLOCK_0)  * num_blocks;   // for DF this is correct

    /* Take off upper byte since for programming/erase addresses for ROM are
          the same as read addresses except upper byte is masked off to 0's.
          Data Flash addresses are not affected. */
    block_start_address &= 0x00FFFFFF;
    entry_address = block_start_address;

    if (num_blocks == 0)
    {
        return(FLASH_ERR_BLOCKS);
    }

    if (flash_valid_addr_check(block_start_address) == true)
    {

        /* Do we want to erase a Data Flash block or ROM block? */
        if ((block_start_address >= FLASH_DF_BLOCK_0) && (block_start_address < FLASH_DF_BLOCK_INVALID ))
        {
            /* Set current FCU mode to data flash PE */
            g_current_mode = FLD_PE_MODE;


            /* Check to make sure erase will not go over the end of DF. */
             if ((block_start_address + bytes_to_erase) > (DF_ADDRESS + MCU_DATA_FLASH_SIZE_BYTES))
             {
                 return FLASH_ERR_OVERFLOW;
             }

             /* Verify address is on block boundary */
             if ((block_start_address & (FLASH_DF_BLOCK_SIZE-1)) != 0)
             {
                 return FLASH_ERR_ADDRESS;
             }
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
             /* Set global variables so that erase can continue in ISR. Set these first so that if the Erase generates an error the
              * error ISR will have the correct address to use in clearing the error flag (the one provided to enter_pe_mode() */
             g_bgo_flash_addr = p_addr + DF_ERASE_BLOCK_SIZE;
             g_bgo_bytes = bytes_to_erase - DF_ERASE_BLOCK_SIZE;
#endif
        }
        else
        {
            /* Set current FCU mode to ROM PE */
            g_current_mode = ROM_PE_MODE;

            // Calculate the total # of bytes to erase,  blocks may differ in sizes.
            bytes_to_erase = flash_get_romBlock_size(block_start_address, &block_info);
            initial_block_number = block_number = block_info.block_number;


            for (blockcnt = 0; blockcnt < num_blocks-1; blockcnt++)
             {
                block_number--;
                // We now have the block number for this address
                if (flash_get_romBlock_info (block_number, &block_info) == false)
                {
                    return(FLASH_ERR_ADDRESS);
                }
                bytes_to_erase += block_info.block_size;
             }

            /* Check to make sure erase will not go over the end of CF. */
             if ((block_start_address + bytes_to_erase) > (ROM_PE_ADDR + MCU_ROM_SIZE_BYTES))
             {
                 return FLASH_ERR_OVERFLOW;
             }

             /* Check for attempts to program over flash area boundaries. These
                boundaries are defined in r_flash_rx*MCU Group*.h as 'ROM_AREA_#'.
                Use ">" rather than ">=" because "bytes" does not include "flash_addr". */
             if (((block_start_address < (ROM_AREA_0)) && ((block_start_address + bytes_to_erase) > ROM_AREA_0))
#if defined(ROM_AREA_1)
                || ((block_start_address < (ROM_AREA_1))  && ((block_start_address + bytes_to_erase) > ROM_AREA_1))
#endif
#if defined(ROM_AREA_2)
                || ((block_start_address < (ROM_AREA_2))  && ((block_start_address + bytes_to_erase) > ROM_AREA_2))
#endif
#if defined(ROM_AREA_3)
                || ((block_start_address < (ROM_AREA_3))  && ((block_start_address + bytes_to_erase) > ROM_AREA_3))
#endif
                 )
             {
                 /* Return cannot write across a flash area boundary */
                 return FLASH_ERR_BOUNDARY;
             }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
        /* Set global variables so that erase can continue in ISR. Set these first so that if the Erase generates an error the
         * error ISR will have the correct address to use in clearing the error flag (the one provided to enter_pe_mode() */
        block_size = flash_get_romBlock_size(block_start_address, &block_info);
        g_bgo_flash_addr = p_addr + block_size;
        g_bgo_bytes = bytes_to_erase - block_size;

#endif
        }

        /* Attempt to grab state */
        if( flash_grab_state(FLASH_ERASING) != FLASH_SUCCESS )
        {
            /* Another operation is already in progress */
            return FLASH_ERR_BUSY;
        }

        /* Enter ROM PE mode, check if operation successful */
        if( enter_pe_mode(block_start_address) != FLASH_SUCCESS)
        {
            /* Make sure part is in ROM read mode. */
            exit_pe_mode(block_start_address);

            /* Release state */
            flash_release_state2();

            /* Return FLASH_FAILURE, operation failure */
            return FLASH_ERR_FAILURE;
        }

#if (FLASH_CFG_IGNORE_LOCK_BITS == 1)
        /* Cancel the ROM Protect feature
           NOTE: If you are using block locking feature to protect your data,
           then comment out 'FLASH_CFG_IGNORE_LOCK_BITS' in r_flash_rx_config.h */
        FLASH.FPROTR.WORD = 0x5501;
#else
        /* Only disable lock bit protection if user has specified to
           do so earlier */
        if( g_lock_bit_protection == false )
        {
            /* Cancel the ROM Protect feature */
            FLASH.FPROTR.WORD = 0x5501;
        }
#endif

        block_number = initial_block_number;
        while(0 < bytes_to_erase)
        {
             /* Send FCU command to erase block */
             result = flash_erase_command((FCU_BYTE_PTR)block_start_address);
             if (result != FLASH_SUCCESS)
                 break;

             if( g_current_mode == ROM_PE_MODE )
             {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                 break;
#endif

                // Code Flash Erase
                 /* Advance pointer to next block */
                 block_number--;

                 // Decrease by the amount we just wrote
                 bytes_to_erase -= (int32_t)block_info.block_size;

