miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
/******************************************************************************
* Function Name: flash_reset
* Description  : Reset the FCU.
*                NOTE: This function MUST execute from in RAM for 'ROM Area'
*                programming, but if you are ONLY doing Data Flash
*                programming, this function can reside and execute in Flash.
* Arguments    : none
* Return Value : none
******************************************************************************/
void flash_reset (void)
{
    /* Declare wait counter variable */
    volatile int32_t    wait_cnt;

    /* Reset the FCU */
    FLASH.FRESETR.WORD = 0xCC01;

    /* Give FCU time to reset */
    wait_cnt = WAIT_TRESW;

    /* Wait until the timer reaches zero */
    while(wait_cnt != 0)
    {
        /* Decrement the timer count each iteration */
        wait_cnt--;
    }

    /* Release state */
    flash_release_state2();

    /* FCU is not reset anymore */
    FLASH.FRESETR.WORD = 0xCC00;

    /* Enter ROM Read mode */
    FLASH.FENTRYR.WORD = 0xAA00;

    /* Initialize timeout for FENTRYR being written. */
    wait_cnt = FLASH_FENTRYR_TIMEOUT;

    /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
       of the FENTRYR register is not retained and is read as 0x00. */
    while(0x0000 != FLASH.FENTRYR.WORD)
    {
        /* Wait until FENTRYR is 0 unless timeout occurs. */
        if (wait_cnt-- <= 0)
        {
            /* This should not happen. FENTRYR getting written to 0 should
               only take 2-4 PCLK cycles. Could add a call to FlashError()
               here if user wants to process this. */
            break;
        }
    }

    /* Flash write/erase disabled */
    FLASH.FWEPROR.BYTE = 0x02;
}


#if (FLASH_CFG_IGNORE_LOCK_BITS == 0)

/******************************************************************************
* Function Name: flash_lockbit_program
* Description  : Programs the lock bit for a specified ROM block. If
*                the lock bit for a block is set and lock bit protection is
*                enabled then that block cannot be programmed/erased.
*                NOTE: This function MUST execute from RAM
* Arguments    :flash_program_lockbit_config_t *lockbit_addr -
*                    Which ROM erasure block to set the lock bit for
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_FAILURE -
*                    Operation Failed
*                FLASH_ERR_BUSY -
*                    Another flash operation is in progress
******************************************************************************/
flash_err_t flash_lockbit_program (flash_program_lockbit_config_t *lockbit_addr)
{
    /* Declare address pointer */
    FCU_BYTE_PTR p_addr;
    /* Declare operation result container variable */
    flash_err_t result = FLASH_SUCCESS;
    /* Declare timer wait count variable */
    volatile int32_t wait_cnt;

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (lockbit_addr->block_addr <= FLASH_CF_BLOCK_INVALID)
    {
        return FLASH_ERR_PARAM;
    }
#endif

    /* Attempt to grab state */
    if( flash_grab_state(FLASH_LOCK_BIT) != FLASH_SUCCESS )
    {
        /* Another operation is already in progress */
        return FLASH_ERR_BUSY;
    }

    /* Flash Command Address */
    p_addr = (FCU_BYTE_PTR)lockbit_addr->block_addr;

    /* Set FCU to ROM PE mode */
    g_current_mode = ROM_PE_MODE;

    /* Enter ROM PE mode, check if operation successful */
    if( enter_pe_mode((uint32_t)p_addr) != FLASH_SUCCESS)
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode((uint32_t)p_addr);

        /* Release state */
        flash_release_state2();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_ERR_FAILURE;
    }

    /* Send the FCU Command */
    *p_addr = 0x77;
    *p_addr = 0xD0;

    /* Set timeout wait counter value */
    wait_cnt = WAIT_MAX_ROM_WRITE;

    /* Wait until FCU operation finishes, or a timeout occurs */
    while(FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if(wait_cnt == 0)
        {
            /* Maximum timeout duration for writing to ROM has elapsed -
               assume operation failure and reset the FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure */
            result = FLASH_ERR_FAILURE;
        }
    }

    /* Check for illegal command or programming errors */
    if((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.PRGERR  == 1))
    {
        /* Return FLASH_FAILURE, operation failure */
        result = FLASH_ERR_FAILURE;
    }

    /* Leave Program/Erase Mode */
    exit_pe_mode((uint32_t)p_addr);

    /* Release state */
    flash_release_state2();

    /* Return result of lock bit programming */
    return result;
}
/******************************************************************************
End of function  R_FlashProgramLockBit
******************************************************************************/




/******************************************************************************
* Function Name: flash_lockbit_read
* Description  : Reads and returns the lock bit status for a ROM block
*                NOTE: This function MUST execute from RAM
* Arguments    : lockbit_info -
*                    Which ROM erasure block to read the lock bit of, and a place to store the result
*
* Return Value : FLASH_SUCCESS - operation successful, lockbit_info->result contains either
*                                FLASH_LOCK_BIT_SET or FLASH_LOCK_BIT_NOT_SET
*                FLASH_FAILURE -
*                    Operation Failed
*                FLASH_ERR_BUSY -
*                    Another flash operation is in progress
******************************************************************************/
flash_err_t flash_lockbit_read (flash_read_lockbit_config_t *lockbit_info)
{
    /* Declare address pointer */
    FCU_BYTE_PTR p_addr;
    /* Declare operation result container variable */
    flash_err_t result = FLASH_SUCCESS;
    /* Holds outcome of lock-bit read */
    uint8_t lock_bit;

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (lockbit_info->block_addr <= FLASH_CF_BLOCK_INVALID)
    {
        return FLASH_ERR_PARAM;
    }
#endif

    /* Attempt to grab state */;
    if( flash_grab_state(FLASH_LOCK_BIT) != FLASH_SUCCESS )
    {
        /* Another operation is already in progress */
        return FLASH_ERR_BUSY;
    }

    /* Flash Command Address */
    p_addr = (FCU_BYTE_PTR)lockbit_info->block_addr;

