miniwinwm/miniwinwm/Renesas/RX65N/MiniWinTTFonts/src/smc_gen/r_flash_rx/src/flash_type_2/r_flash_type2.c
    /* Set FCU to ROM PE mode */
    g_current_mode = ROM_PE_MODE;

    /* Enter ROM PE mode, check if operation successful */
    if( enter_pe_mode((uint32_t)p_addr) != FLASH_SUCCESS)
    {
        /* Make sure part is in ROM read mode. */
        exit_pe_mode((uint32_t)p_addr);

        /* Release state */
        flash_release_state2();

        /* Return FLASH_FAILURE, operation failure */
        return FLASH_ERR_FAILURE;
    }

    /* Switch to ROM Lock-Bit Read Mode */
    *p_addr = 0x71;

    /* Check for illegal command */
    if(FLASH.FSTATR0.BIT.ILGLERR == 1)
    {
        /* Return FLASH_FAILURE, operation failure */
        result = FLASH_ERR_FAILURE;
    }
    else
    {
        /* Read lock bit value */
        lock_bit = *p_addr;

        /* Set return value */
        if(lock_bit != 0x00)
        {
            /* Lock bit is not set */
            lockbit_info->result = FLASH_LOCK_BIT_NOT_SET;
        }
        else
        {
            /* Lock bit is set */
            lockbit_info->result = FLASH_LOCK_BIT_SET;
        }
    }

    /* Leave Program/Erase Mode */
    exit_pe_mode((uint32_t)p_addr);

    /* Release state */
    flash_release_state2();

    /* Return result of lock bit programming */
    return result;
}
/******************************************************************************
End of function  R_FlashReadLockBit
******************************************************************************/
#endif





/******************************************************************************
* Function Name: flash_get_program_size
* Description  : Gets the number of bytes that can be written at this time.
*                Since the DF and ROM have different available programming
*                sizes, we want to use the largest option to save time.
* Arguments    : bytes -
*                    How many bytes are left to write total.
*                flash_addr -
*                    Current address we are writing to.
* Return Value : Number of bytes to write at this time.
******************************************************************************/
static uint32_t flash_get_program_size (uint32_t bytes, uint32_t flash_addr)
{
    uint32_t num_byte_to_write = 0;

    if( g_current_mode == FLD_PE_MODE )
    {
        /* This is a DF write. */
#if defined(DF_PROGRAM_SIZE_LARGE)
        if( (bytes >= DF_PROGRAM_SIZE_LARGE) &&
            ((flash_addr & (DF_PROGRAM_SIZE_LARGE-1)) == 0x00))
        {
            /* Use large write size since it's more time efficient */
            num_byte_to_write = DF_PROGRAM_SIZE_LARGE;
        }
        else
        {
            /* Cannot use large program size, use small */
            num_byte_to_write = DF_PROGRAM_SIZE_SMALL;
        }
#else
        /* Set the next data transfer size to be DF_PROGRAM_SIZE_SMALL*/
        num_byte_to_write = DF_PROGRAM_SIZE_SMALL;
#endif
    }
    else
    {
        /* This is a ROM write. */
#if defined(ROM_PROGRAM_SIZE_LARGE)
        if( (bytes >= ROM_PROGRAM_SIZE_LARGE) &&
            ((flash_addr & (ROM_PROGRAM_SIZE_LARGE-1)) == 0x00))
        {
            /* Use large write size since it's more time efficient */
            num_byte_to_write = ROM_PROGRAM_SIZE_LARGE;
        }
    #if defined(ROM_PROGRAM_SIZE_MEDIUM)
        else if( (bytes >= ROM_PROGRAM_SIZE_MEDIUM) &&
                 ((flash_addr & (ROM_PROGRAM_SIZE_MEDIUM-1)) == 0x00))
        {
            /* Use large write size since it's more time efficient */
            num_byte_to_write = ROM_PROGRAM_SIZE_MEDIUM;
        }
    #endif
        else
        {
            /* Cannot use large program size, use small */
            num_byte_to_write = ROM_PROGRAM_SIZE_SMALL;
        }
#else
        /* Set the next data transfer size to be smallest supported write. */
        num_byte_to_write = ROM_PROGRAM_SIZE;
#endif
    }

    return num_byte_to_write;
}



/******************************************************************************
* Function Name: notify_peripheral_clock
* Description  : Notifies FCU or clock supplied to flash unit
*                NOTE: This function MUST execute from in RAM for 'ROM Area'
*                programming, but if you are ONLY doing Data Flash programming,
*                this function can reside and execute in Flash.
* Arguments    : flash_addr -
*                    Flash address you will be erasing or writing to
* Return Value : FLASH_SUCCESS -
*                    Operation Successful
*                FLASH_FAILURE -
*                    Operation Failed
******************************************************************************/
static uint8_t notify_peripheral_clock (FCU_BYTE_PTR flash_addr)
{
    /* Declare wait counter variable */
    volatile int32_t wait_cnt;

    /* Notify Peripheral Clock(PCK) */
    /* Set frequency of PCK in MHz */
    FLASH.PCKAR.WORD = (MCU_CFG_FCLK_HZ/1000000);

    /* Execute Peripheral Clock Notification Commands */
    *flash_addr = 0xE9;
    *flash_addr = 0x03;
    *(FCU_WORD_PTR)flash_addr = 0x0F0F;
    *(FCU_WORD_PTR)flash_addr = 0x0F0F;
    *(FCU_WORD_PTR)flash_addr = 0x0F0F;
    *flash_addr = 0xD0;

    /* Set timeout wait duration */
    wait_cnt = WAIT_MAX_NOTIFY_FCU_CLOCK;

    /* Check FRDY */
    while(FLASH.FSTATR0.BIT.FRDY == 0)
    {
        /* Decrement wait counter */
        wait_cnt--;

        /* Check if wait counter has reached zero */
        if(wait_cnt == 0)
        {
            /* Timeout duration elapsed, assuming operation failure - Reset
               FCU */
            flash_reset();

            /* Return FLASH_FAILURE, operation failure  */
            return FLASH_ERR_FAILURE;
        }
    }

    /* Check ILGLERR */
    if(FLASH.FSTATR0.BIT.ILGLERR == 1)
    {
        /* Return FLASH_FAILURE, operation failure*/
        return FLASH_ERR_FAILURE;
    }

    /* Return FLASH_SUCCESS, operation success */
    return FLASH_SUCCESS;
}
/******************************************************************************
End of function notify_peripheral_clock
******************************************************************************/





#endif

#pragma section // end FLASH_SECTION_ROM
